package com.example.myapplication2
// ==================================================class(자료형)
class 준비된_재료
class 씻은_야채
class 조리된_닭갈비
// ==================================================




// ==================================================funtion
fun 닭다리살_손질_준비(닭다리살 : Int = 600) : 준비된_재료{
    //닭다리 손질
    return 준비된_재료()
}

fun 야채씻기(야채 : String) : 씻은_야채{
    return 씻은_야채()
}

fun 양념장섞기(양념재료 : String) : 준비된_재료{
//    고추장 2큰술
//    고춧가루 1큰술
//    간장 2큰술
//    설탕 1.5큰술
//    다진 마늘 1큰술
//    다진 생강 1/2작은술
//    맛술(미림) 1큰술
//    참기름 1작은술
//    후추 약간
    return 준비된_재료()
}

// fire : 불 강도(1 = 약불, 2 = 중불, 3 = 강불)
// ingredient : 재료(손질된_닭다리살, 준비된_야채, 준비된_양념장)
// time : 요리 시간(분)
fun 볶기(fire : Int, 준비된재료들 : List<준비된_재료>, 씻은_야채들 : List<씻은_야채>, time : Int) : 조리된_닭갈비 {
    return 조리된_닭갈비()
}
// ==================================================



fun main(){
//    🐓 닭갈비 레시피 (2~3인분 기준)

//    재료 손질하기
    var 준비된_닭다리살 = 닭다리살_손질_준비()

    var 씻은양배추 = 야채씻기("양배추")
    var 씻은고구마 = 야채씻기("고구마")
    var 씻은양파 = 야채씻기("양파")
    var 씻은대파 = 야채씻기("대파")

    var 씻은야채들 = listOf<씻은_야채>(씻은양배추, 씻은고구마, 씻은양파, 씻은대파)






//    볶기
    var 완성된_닭갈비 = 볶기(2, listOf(), listOf<씻은_야채>(씻은양배추, 씻은고구마, 씻은양파, 씻은대파), 30)

//    마무리
}